list_of_num = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]


# количество чисел в списке
print(len(list_of_num))


# получить диапазон от 30 до 60 четных чисел (без использования цикла)
a = list_of_num[29:60:2]
print(a)


# получить обратный (перевернутый) диапазон нечетных чисел от 20 до 50
b = list_of_num[20:49:2]
b.reverse()
print(b)

# разделите список на 3, заключите третий список внутрь второго, а второй внутрь первого [1...33,[34...66, [67..100]]]
c = list_of_num[:33]
d = list_of_num[33:66]
e = list_of_num[66:]

d.append(e)
c.append(d)
print(c)